bot_texts = {"start_text": 'Привет и добро пожаловать в CART FLIPPER BOT! 👋\n\nНиже ты видишь главное меню бота ⬇️\n\n'
                           'Для начала обучения нажми Учиться" 🧑‍🏫\nДля создания или редактирования коллекций для '
                           'обучения нажми "Коллекции" 📜',
             "stop_education_cmd": "Закончить обучение 🙅‍♂️",
             "return_in_main_menu": "Вы вернулись в главное меню 📎\n\nВыберите что хотите сделать дальше ⬇️",
             "collection_name_to_long": "Это имя слишком длинное! 🟥\n\nПришлите имя длиной до 25 символов ⬇️",
             "send_new_collection_name": "Как вы назовете новую коллекцию? 🧑‍🎨"}
